{
    "introduction": {
        "p1": "Jag är Jessica Hvirfvel - en kreativ, logiskt tänkande pysselfantast som gillar att organisera och problemlösa. Att lära mig nytt och få en förståelse för hur saker hänger ihop är en drivkraft för mig. Jag har länge varit intresserad av IT och grafisk design men inte varit säker på hur jag skulle fullfölja det. Det förändrades 2020 när min syster introducerade mig för HTML och CSS, och från det ögonblicket var jag såld.",
        "p2": "Snabbspolning till idag har jag en filosofie kandidatexamen (180 hp) med huvudområde informatik från Karlstads universitet, där jag gick <a href=\"https://www.kau.se/utbildning/program-och-kurser/program/SGWEB\" target=\"_blank\" rel=\"noopener noreferrer\">Webbutvecklarprogrammet</a>, och jag är fullt intresserad av fullstack-utveckling!",
        "p3": "Let's connect!"
    },
    "funfacts": [
        {
            "icon": "tools",
            "alt": "Tools Icon",
            "fact": "Ge mig ett oöppnat paket från Ikea och jag kommer med glädje bygga ihop den"
        },
        {
            "icon": "backpack",
            "alt": "Backback Icon",
            "fact": "Jag har backpackat i ca 1,5 år i sydostasien och europa"
        },
        {
            "icon": "event",
            "alt": "Event Icon",
            "fact": "Jag har varit ansvarig över ett två veckor långt event för 250 pers"
        },
        {
            "icon": "parachute",
            "alt": "Parachute Icon",
            "fact": "Jag har hoppat fallskärm från 4000 meters höjd"
        },
        {
            "icon": "diploma",
            "alt": "Diploma Icon",
            "fact": "Jag har mottagit ett diplom för mitt grafiska bidragande till min dåvarande studentförening"
        },
        {
            "icon": "puzzle",
            "alt": "Puzzle Icon",
            "fact": "Jag är grym på pussel och slutar inte förrän alla bitar är på sin plats"
        }
    ],
    "currentlyA": "Vad vore fun facts utan bildbevis? Kika på galleriet vetja!",
    "currentlyB": "Vad pysslar jag med på min fritid mån tro? Jo just nu sitter jag med att förbättra detta portfolio och ett Jeopardy-liknande spel, båda med hjälp av React. Utöver det breddar jag mina kunskaper genom online kurser. Hur kul!",
    "experienceText": {
        "text": "Erfarenhet från Karsltad universitet och egen lärning. Part ",
        "coder": "kodare.",
        "designer": "designer."
    },
    "experience": [
        {
            "title": "Frontend-utveckling",
            "techniques": [
                "HTML",
                "CSS",
                "Bootstrap",
                "Tailwind",
                "JavaScript",
                "React",
                "TypeScript",
                "WordPress",
                "React Native"
            ]
        },
        {
            "title": "Backend-utveckling",
            "techniques": [
                "NodeJS",
                "Express",
                "Django",
                "Django REST Framework",
                "PHP",
                "C#",
                ".NET"
            ]
        },
        {
            "title": "Mjukvaruutveckling & OOP",
            "techniques": [
                "Java",
                "C",
                "C#",
                ".NET",
                "Python",
                "OOP Principles"
            ]
        },
        {
            "title": "Databas, Datahantering & API",
            "techniques": [
                "REST API",
                "MySQL",
                "MongoDB",
                "XAMPP",
                "Postman",
                "JSON",
                "XML"
            ]
        },
        {
            "title": "Test & Kvalitetssäkring",
            "techniques": [
                "Mjukvarutestning",
                "Python",
                "Java",
                "Unit Testing",
                "Jest",
                "TypeScript",
                "NodeJS"
            ]
        },
        
        {
            "title": "UX",
            "techniques": [
                "Prototypskapande",
                "Interaktionsdesign",
                "Tillgänglighet",
                "WCAG",
                "ATAG"
            ]
        },
        {
            "title": "Designverktyg",
            "techniques": [
                "Adobe Photoshop",
                "Adobe Illustrator",
                "Adobe InDesign",
                "Figma",
                "2c8"
            ]
        },
        {
            "title": "Utvecklarverktyg & IDE",
            "techniques": [
                "Git", 
                "GitHub",
                "VS Code",
                "Visual Studio",
                "Eclipse",
                "PyCharm",
                "Android Studio",
                "CodeBlocks"
            ]
        }
    ],
    "certificateLinkTitle": "Visa certifikat",
    "certificate": [
        {
            "id": 1,
            "description": "En utbildning som kombinerar teknisk utveckling med användarcentrerad design. Under utbildningen har jag fått en bred förståelse för webbutveckling, där jag har lärt mig att skapa webbplatser och webbaserade system med moderna programmeringsspråk och tekniker.<br><br>Utöver den tekniska delen har jag även utvecklat kunskaper inom interaktionsdesign och systemdesign, med fokus på att bygga lösningar utifrån användarens behov. Informatik har varit en central del av utbildningen, vilket innebär att jag har arbetat med kopplingen mellan IT, verksamheter och människor. Genom detta har jag fått en helhetssyn på hur teknik kan användas för att skapa smarta och effektiva digitala lösningar."
        },
        {
            "id": 2,
            "description": "Den här kursen gav djupgående utbildning i TypeScript, och innehöll typesystem, moderna JavaScript-funktioner och avancerade koncept som generics, decorators och moduler. Jag lärde mig att konfigurera TypeScript-kompilatorn, integrera tredjepartsbibliotek och optimera arbetsflöden med webpack.<br><br>Genom praktiska projekt tillämpade jag TypeScript i verkliga scenarier, inklusive ReactJS och Node.js/Express-applikationer. Detta certifikat visar min förmåga att skriva skalbar, underhållbar och felfri kod med TypeScript."
        },
        {
            "id": 3,
            "description": "Den här kursen fokuserar på att bemästra TypeScript och enhetstestning med Jest för att skriva robust och felfri kod. Den täcker hur man sätter upp Node.js och TypeScript-projekt, konfigurerar Jest och skriver enhetstester och integrationstester. Jag lärde mig avancerade testtekniker som mocking, stubbing och att skapa djupa mocks för komplexa bibliotek, samt att testa asynkron kod både i Node.js och React-applikationer.<br><br>Kursen betonar Test-Driven Development (TDD) och leder dig genom praktiska övningar som en lösenordskontroll, samt lär ut integrationstestning för REST APIs. Jag fick praktisk erfarenhet av Jest:s funktioner, vilket gjorde mig skicklig på att skriva omfattande tester för verkliga applikationer."
        },
        {
            "id": 4,
            "description": "Den här nybörjarvänliga kursen ger en omfattande introduktion till molntjänster med AWS. Jag lärde mig grundläggande AWS-tjänster och molnkoncept, från grunderna till avancerade tekniker, genom praktiska övningar med ett AWS Free Tier-konto. Kursen täcker molnens grundläggande funktioner som lagring, nätverk och virtualisering, och går igenom AWS-tjänster som EC2, S3, RDS och Lambda.<br><br>I slutet av kursen hade jag de färdigheter som krävs för att distribuera och hantera molninfrastruktur, implementera automation med DevOps-verktyg och arbeta med serverlös databehandling. Den här kursen är perfekt för den som vill påbörja en karriär inom molntjänster och ger en bra grund för AWS-certifieringsexamen som AWS Certified Cloud Practitioner."
        },
        {
            "id": 5,
            "description": "Denna full-stack kurs täckte Django, React och React Native för att bygga kompletta applikationer, inklusive backend RESTful API, frontend web appar och mobilappar för både Android och iOS. Jag lära mig användarautentisering, fullständiga CRUD-operationer, egna API-endpoints och hur man kommunicerar mellan API och webapp.<br><br>Kursen inkluderar också styling av applikationen och begränsning av sektioner för endast autentiserade användare. Genom att använda JavaScript och Python får du praktisk erfarenhet med dessa populära ramverk och lärde jag mig att distribuera applikationer på en produktionsserver gratis."
        }
    ]
}